miniproject1/baseCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            freestreamPressure;
        freestreamValue           uniform 0;
    }

    body
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            fixedValue;
        value           uniform 0;
    }

    sides
    {
        type            fixedValue;
        value           uniform 0;
    }

}


// ************************************************************************* //
