miniproject1/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       1027086;
    }
    outlet
    {
        type            patch;
        nFaces          600;
        startFace       1027686;
    }
    sides
    {
        type            patch;
        nFaces          4800;
        startFace       1028286;
    }
    top
    {
        type            patch;
        nFaces          3600;
        startFace       1033086;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       1036686;
    }
    body
    {
        type            wall;
        inGroups        1(wall);
        nFaces          18894;
        startFace       1040286;
    }
)

// ************************************************************************* //
