miniproject1/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-8.343 -1.167 -0.569)     //0
    (3.141 -1.167 -0.569)     //1
    (3.141 1.556 -0.569)     //2
    (-8.343 1.556 -0.569)     //3
    (-8.343 -1.167 0.87)   //4
    (3.141 -1.167 0.87)   //5
    (3.141 1.556 0.87)   //6
    (-8.343 1.556 0.87)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) outerbox (120 30 20) simpleGrading (1 1 1)   //b0
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)   //b0
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)    //b40
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)   //b0
            (2 3 7 6)   //b0
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)   //b0
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (3 2 1 0)   //b0
        );
    }
);


// ************************************************************************* //
