miniproject1/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;
writeFormat     ascii;
writePresicion  6;
writeCompression off;

timeFormat      general;
timeprecision   6;

//adjustTimeStep yes;

//maxCo           0.5;

/* functions
{
    mag
    {
        type            mag;
        libs            (fieldFunctionObjects);
        field           U;
        writeControl    outputTime;
    }
} */

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (body);
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 0);
        liftDir         (0 0 1);
        dragDir         (-1 0 0);
        pitchAxis       (0 1 0);
        magUInf         20;
        lRef            1.044;
        Aref            0.112032;
        writeControl    timeStep;
        writeInterval   1;
    }

    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (body);
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 0);
        writeControl    timeStep;
        writeInterval   1;
    }

    solverInfo1
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (p U k omega);
        writeControl    timeStep;
        writeInterval   1;
    }
}
